In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "Name" : ['Heer','Jivika', 'Kanchan','Namisha','Kusum','Sonia','Anisha','Manisha'],
    "Marks": [92,34,24,89,60,75,80,65],
    "City": ['Mithi','Karachi','Lahore','Islamabad','Kashmir','Sukkur','Kashmoor','Diplo']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

      Name  Marks       City
0     Heer     92      Mithi
1   Jivika     34    Karachi
2  Kanchan     24     Lahore
3  Namisha     89  Islamabad
4    Kusum     60    Kashmir
5    Sonia     75     Sukkur
6   Anisha     80   Kashmoor
7  Manisha     65      Diplo

In [5]:
data1 = [
    ['Ali',20],
    ['Sara',22],
    ['Ahmed',23]
]
df1 = pd.DataFrame(data1,columns = ['Name', 'Age'])
df1

    Name  Age
0    Ali   20
1   Sara   22
2  Ahmed   23

In [6]:
data2 = [
    ('Suhani', 23),
    ('Ishani', 25),
    ('Sandhya', 27)
]
df2 = pd.DataFrame(data2, columns = ['Name','Age'])
df2

      Name  Age
0   Suhani   23
1   Ishani   25
2  Sandhya   27

In [7]:
data3 = np.array([[1,2],[3,4],[5,6]])
df3 = pd.DataFrame(data3, columns=['A','B'])
df3

   A  B
0  1  2
1  3  4
2  5  6

In [8]:
Data5 = {
    'Age': [18, 20, 19, 22, 21, 20, 23, 19, 18, 22],
    'Height_cm': [160, 165, 162, 170, 168, 166, 172, 161, 159, 171],
    'Weight_kg': [55, 60, 58, 65, 63, 62, 68, 57, 54, 66]  # optional extra column
}
df5 = pd.DataFrame(Data5)
df5

   Age  Height_cm  Weight_kg
0   18        160         55
1   20        165         60
2   19        162         58
3   22        170         65
4   21        168         63
5   20        166         62
6   23        172         68
7   19        161         57
8   18        159         54
9   22        171         66

In [9]:
df5.describe()

            Age   Height_cm  Weight_kg
count  10.00000   10.000000  10.000000
mean   20.20000  165.400000  60.800000
std     1.75119    4.765618   4.779586
min    18.00000  159.000000  54.000000
25%    19.00000  161.250000  57.250000
50%    20.00000  165.500000  61.000000
75%    21.75000  169.500000  64.500000
max    23.00000  172.000000  68.000000

In [10]:
df.to_csv('result.csv')

In [11]:
df.to_excel('result.xlsx')

In [12]:
df.to_csv('trial.csv', index = False)

In [13]:
df.head(2)

     Name  Marks     City
0    Heer     92    Mithi
1  Jivika     34  Karachi

In [14]:
df.tail(2)

      Name  Marks      City
6   Anisha     80  Kashmoor
7  Manisha     65     Diplo

In [15]:
df.head()

      Name  Marks       City
0     Heer     92      Mithi
1   Jivika     34    Karachi
2  Kanchan     24     Lahore
3  Namisha     89  Islamabad
4    Kusum     60    Kashmir

In [16]:
df.tail()

      Name  Marks       City
3  Namisha     89  Islamabad
4    Kusum     60    Kashmir
5    Sonia     75     Sukkur
6   Anisha     80   Kashmoor
7  Manisha     65      Diplo

In [17]:
df.describe()

          Marks
count   8.00000
mean   64.87500
std    24.77578
min    24.00000
25%    53.50000
50%    70.00000
75%    82.25000
max    92.00000

In [18]:
PersonData = pd.read_excel("D:\PythonOnJupyter\Persons'Data.xlsx")

In [19]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg
0           0   1     Ali    Male   18        160         55
1           1   2    Sara  Female   20        165         60
2           2   3   Ahmed    Male   19        162         58
3           3   4  Ayesha  Female   22        170         65
4           4   5   Bilal    Male   40        168         63
5           5   6    Hina  Female   20        166         62
6           6   7  Kamran    Male   23        172         68
7           7   8    Zara  Female   19        161         57
8           8   9    Omar    Male   18        159         54
9           9  10    Sana  Female   22        171         66

In [20]:
PersonData['Age']

0    18
1    20
2    19
3    22
4    40
5    20
6    23
7    19
8    18
9    22
Name: Age, dtype: int64

In [21]:
PersonData['Age'][3]

np.int64(22)

In [22]:
PersonData['Age'][4]=40

C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\4209483046.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  PersonData['Age'][4]=40

In [23]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg
0           0   1     Ali    Male   18        160         55
1           1   2    Sara  Female   20        165         60
2           2   3   Ahmed    Male   19        162         58
3           3   4  Ayesha  Female   22        170         65
4           4   5   Bilal    Male   40        168         63
5           5   6    Hina  Female   20        166         62
6           6   7  Kamran    Male   23        172         68
7           7   8    Zara  Female   19        161         57
8           8   9    Omar    Male   18        159         54
9           9  10    Sana  Female   22        171         66

In [24]:
PersonData = pd.read_excel("D:\PythonOnJupyter\Persons'Data.xlsx")
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg
0           0   1     Ali    Male   18        160         55
1           1   2    Sara  Female   20        165         60
2           2   3   Ahmed    Male   19        162         58
3           3   4  Ayesha  Female   22        170         65
4           4   5   Bilal    Male   40        168         63
5           5   6    Hina  Female   20        166         62
6           6   7  Kamran    Male   23        172         68
7           7   8    Zara  Female   19        161         57
8           8   9    Omar    Male   18        159         54
9           9  10    Sana  Female   22        171         66

In [25]:
PersonData.index= ['A','B','C','D','E','F','G','H','I','J']
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg
A           0   1     Ali    Male   18        160         55
B           1   2    Sara  Female   20        165         60
C           2   3   Ahmed    Male   19        162         58
D           3   4  Ayesha  Female   22        170         65
E           4   5   Bilal    Male   40        168         63
F           5   6    Hina  Female   20        166         62
G           6   7  Kamran    Male   23        172         68
H           7   8    Zara  Female   19        161         57
I           8   9    Omar    Male   18        159         54
J           9  10    Sana  Female   22        171         66

In [26]:
PersonData['BMI']=[24.5, 34.4, 34.1, 31.7, 26.0, 17.4, 18.7, 25.9, 27.2, 30.5]
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1     Ali    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [27]:
Series = pd.Series(np.random.rand(34))
Series

0     0.471066
1     0.946659
2     0.634210
3     0.427289
4     0.117008
5     0.843488
6     0.761558
7     0.927428
8     0.385255
9     0.320433
10    0.265927
11    0.346946
12    0.466095
13    0.864194
14    0.679733
15    0.360978
16    0.666786
17    0.343920
18    0.944572
19    0.852709
20    0.393295
21    0.545176
22    0.564835
23    0.741864
24    0.112718
25    0.945986
26    0.152499
27    0.818462
28    0.162266
29    0.996375
30    0.282202
31    0.664041
32    0.395238
33    0.130891
dtype: float64

In [28]:
Dataframe = pd.DataFrame(np.random.rand(34))
Dataframe

           0
0   0.990609
1   0.319791
2   0.442629
3   0.429660
4   0.903964
5   0.546531
6   0.516199
7   0.735835
8   0.076234
9   0.926921
10  0.215349
11  0.962179
12  0.364480
13  0.690484
14  0.301628
15  0.726487
16  0.525532
17  0.119080
18  0.397875
19  0.309122
20  0.775939
21  0.819148
22  0.551433
23  0.968649
24  0.263024
25  0.022722
26  0.756508
27  0.145279
28  0.961690
29  0.636206
30  0.932425
31  0.016785
32  0.645092
33  0.018871

In [29]:
newdf = pd.DataFrame(np.random.rand(334,5))
newdf

            0         1         2         3         4
0    0.501790  0.913862  0.259560  0.816872  0.637221
1    0.079425  0.074924  0.737844  0.822635  0.837289
2    0.465109  0.591554  0.655995  0.946691  0.801459
3    0.723546  0.542089  0.762664  0.497110  0.697865
4    0.194506  0.222005  0.004111  0.020448  0.232338
..        ...       ...       ...       ...       ...
329  0.341958  0.996280  0.601016  0.996155  0.886569
330  0.467686  0.758385  0.396757  0.584264  0.706021
331  0.094481  0.612053  0.840060  0.594438  0.678801
332  0.852265  0.430549  0.027657  0.761727  0.209917
333  0.351363  0.675965  0.314056  0.890269  0.373096

[334 rows x 5 columns]

In [30]:
PersonData.dtypes

Unnamed: 0      int64
ID              int64
Name           object
Gender         object
Age             int64
Height_cm       int64
Weight_kg       int64
BMI           float64
dtype: object

In [31]:
type(PersonData)

pandas.core.frame.DataFrame

In [32]:
PersonData['Gender'].dtypes

dtype('O')

In [33]:
PersonData.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [34]:
PersonData.columns

Index(['Unnamed: 0', 'ID', 'Name', 'Gender', 'Age', 'Height_cm', 'Weight_kg',
       'BMI'],
      dtype='object')

In [35]:
 newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.501790,0.079425,0.465109,0.723546,0.194506,0.735834,0.166215,0.874076,0.420912,0.149385,...,0.691684,0.573138,0.441990,0.441950,0.308678,0.341958,0.467686,0.094481,0.852265,0.351363
1,0.913862,0.074924,0.591554,0.542089,0.222005,0.944393,0.510624,0.035932,0.433330,0.007143,...,0.041120,0.917156,0.117966,0.204176,0.985690,0.996280,0.758385,0.612053,0.430549,0.675965
2,0.259560,0.737844,0.655995,0.762664,0.004111,0.445270,0.930057,0.683175,0.273825,0.454224,...,0.801982,0.024533,0.575099,0.945734,0.008054,0.601016,0.396757,0.840060,0.027657,0.314056
3,0.816872,0.822635,0.946691,0.497110,0.020448,0.533306,0.133452,0.868156,0.592596,0.351329,...,0.851142,0.567487,0.295253,0.070652,0.778427,0.996155,0.584264,0.594438,0.761727,0.890269
4,0.637221,0.837289,0.801459,0.697865,0.232338,0.281913,0.872139,0.252776,0.847167,0.932699,...,0.020797,0.222690,0.842601,0.867941,0.737266,0.886569,0.706021,0.678801,0.209917,0.373096

In [36]:
PersonData.T

,A,B,C,D,E,F,G,H,I,J
Unnamed: 0,0,1,2,3,4,5,6,7,8,9
ID,1,2,3,4,5,6,7,8,9,10
Name,Ali,Sara,Ahmed,Ayesha,Bilal,Hina,Kamran,Zara,Omar,Sana
Gender,Male,Female,Male,Female,Male,Female,Male,Female,Male,Female
Age,18,20,19,22,40,20,23,19,18,22
Height_cm,160,165,162,170,168,166,172,161,159,171
Weight_kg,55,60,58,65,63,62,68,57,54,66
BMI,24.5,34.4,34.1,31.7,26.0,17.4,18.7,25.9,27.2,30.5

In [37]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1     Ali    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [38]:
PersonData.T

,A,B,C,D,E,F,G,H,I,J
Unnamed: 0,0,1,2,3,4,5,6,7,8,9
ID,1,2,3,4,5,6,7,8,9,10
Name,Ali,Sara,Ahmed,Ayesha,Bilal,Hina,Kamran,Zara,Omar,Sana
Gender,Male,Female,Male,Female,Male,Female,Male,Female,Male,Female
Age,18,20,19,22,40,20,23,19,18,22
Height_cm,160,165,162,170,168,166,172,161,159,171
Weight_kg,55,60,58,65,63,62,68,57,54,66
BMI,24.5,34.4,34.1,31.7,26.0,17.4,18.7,25.9,27.2,30.5

In [39]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1     Ali    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [40]:
PersonData.sort_index(ascending = False)

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
J           9  10    Sana  Female   22        171         66  30.5
I           8   9    Omar    Male   18        159         54  27.2
H           7   8    Zara  Female   19        161         57  25.9
G           6   7  Kamran    Male   23        172         68  18.7
F           5   6    Hina  Female   20        166         62  17.4
E           4   5   Bilal    Male   40        168         63  26.0
D           3   4  Ayesha  Female   22        170         65  31.7
C           2   3   Ahmed    Male   19        162         58  34.1
B           1   2    Sara  Female   20        165         60  34.4
A           0   1     Ali    Male   18        160         55  24.5

In [41]:
PersonData.sort_index(axis = 1, ascending = False)

   Weight_kg  Unnamed: 0    Name  ID  Height_cm  Gender   BMI  Age
A         55           0     Ali   1        160    Male  24.5   18
B         60           1    Sara   2        165  Female  34.4   20
C         58           2   Ahmed   3        162    Male  34.1   19
D         65           3  Ayesha   4        170  Female  31.7   22
E         63           4   Bilal   5        168    Male  26.0   40
F         62           5    Hina   6        166  Female  17.4   20
G         68           6  Kamran   7        172    Male  18.7   23
H         57           7    Zara   8        161  Female  25.9   19
I         54           8    Omar   9        159    Male  27.2   18
J         66           9    Sana  10        171  Female  30.5   22

In [42]:
MyDf = PersonData
MyDf['Name'][0] = 'Sajid'
MyDf

C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\1075973671.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  MyDf['Name'][0] = 'Sajid'
C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\1075973671.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  MyDf['Name'][0] = 'Sajid'
C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\1075973671.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  MyDf['Name'][0] = 'Sajid'

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [43]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [44]:
OurDf = MyDf.copy()
OurDf['Name'][1] = 'Nata'
OurDf

C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\3929347501.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  OurDf['Name'][1] = 'Nata'
C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\3929347501.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  OurDf['Name'][1] = 'Nata'
C:\Users\DELL\AppData\Local\Temp\ipykernel_6952\3929347501.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  OurDf['Name'][1] = 'Nata'

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Nata  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [45]:
MyDf

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [46]:
PersonData.loc['B','Gender']

'Female'

In [47]:
PersonData.loc[(PersonData['Gender']== 'Female')& (PersonData['Height_cm']>165)]

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
D           3   4  Ayesha  Female   22        170         65  31.7
F           5   6    Hina  Female   20        166         62  17.4
J           9  10    Sana  Female   22        171         66  30.5

In [48]:
PersonData.loc[['A','E'],['Name','Gender']]

    Name Gender
A  Sajid   Male
E  Bilal   Male

In [49]:
PersonData.loc[['B','C'],:]

   Unnamed: 0  ID   Name  Gender  Age  Height_cm  Weight_kg   BMI
B           1   2   Sara  Female   20        165         60  34.4
C           2   3  Ahmed    Male   19        162         58  34.1

In [50]:
PersonData.loc[:,['Name','Gender']]

     Name  Gender
A   Sajid    Male
B    Sara  Female
C   Ahmed    Male
D  Ayesha  Female
E   Bilal    Male
F    Hina  Female
G  Kamran    Male
H    Zara  Female
I    Omar    Male
J    Sana  Female

In [51]:
OurDf.columns = ['Index', 'Roll_no.', 'FullName', 'Gender', 'YearsOld', 'Height', 'Weight', 'BMIs']
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Zara  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [67]:
OurDf.duplicated()

A    False
B    False
C    False
D    False
E    False
F    False
G    False
H    False
I    False
J    False
dtype: bool

In [52]:
OurDf.iloc[0:5,0:3]

   Index  Roll_no. FullName
A      0         1    Sajid
B      1         2     Nata
C      2         3    Ahmed
D      3         4   Ayesha
E      4         5    Bilal

In [53]:
OurDf.iloc[:,0:3]

   Index  Roll_no. FullName
A      0         1    Sajid
B      1         2     Nata
C      2         3    Ahmed
D      3         4   Ayesha
E      4         5    Bilal
F      5         6     Hina
G      6         7   Kamran
H      7         8     Zara
I      8         9     Omar
J      9        10     Sana

In [54]:
OurDf.iloc[0:5,:]

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0

In [55]:
OurDf.iloc[3,5]

np.int64(170)

In [56]:
OurDf.iloc[:,:]

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Zara  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [57]:
OurDf.iloc[[1,5],[2,6]]

  FullName  Weight
B     Nata      60
F     Hina      62

In [58]:
OurDf.iloc[0:4]

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7

In [59]:
OurDf.iloc[0:4,3]

A      Male
B    Female
C      Male
D    Female
Name: Gender, dtype: object

In [60]:
OurDf.iloc[4,0:3]

Index           4
Roll_no.        5
FullName    Bilal
Name: E, dtype: object

In [61]:
OurDf.shape

(10, 8)

In [62]:
OurDf.size

80

In [63]:
OurDf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to J
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Index     10 non-null     int64
 1   Roll_no.  10 non-null     int64
 2   FullName  10 non-null     object
 3   Gender    10 non-null     object
 4   YearsOld  10 non-null     int64
 5   Height    10 non-null     int64
 6   Weight    10 non-null     int64
 7   BMIs      10 non-null     float64
dtypes: float64(1), int64(5), object(2)
memory usage: 1020.0+ bytes

In [64]:
OurDf[['FullName','Gender','YearsOld']]

  FullName  Gender  YearsOld
A    Sajid    Male        18
B     Nata  Female        20
C    Ahmed    Male        19
D   Ayesha  Female        22
E    Bilal    Male        40
F     Hina  Female        20
G   Kamran    Male        23
H     Zara  Female        19
I     Omar    Male        18
J     Sana  Female        22

OurDf['FullName','Gender','YearsOld']

In [65]:
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Zara  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [66]:
OurDf['FullName'].value_counts()

FullName
Sajid     1
Nata      1
Ahmed     1
Ayesha    1
Bilal     1
Hina      1
Kamran    1
Zara      1
Omar      1
Sana      1
Name: count, dtype: int64

In [67]:
OurDf.loc['H','FullName']='Nata'
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Nata  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [68]:
OurDf['FullName'].value_counts()

FullName
Nata      2
Sajid     1
Ahmed     1
Ayesha    1
Bilal     1
Hina      1
Kamran    1
Omar      1
Sana      1
Name: count, dtype: int64

In [69]:
OurDf.value_counts()

Index  Roll_no.  FullName  Gender  YearsOld  Height  Weight  BMIs
0      1         Sajid     Male    18        160     55      24.5    1
1      2         Nata      Female  20        165     60      34.4    1
2      3         Ahmed     Male    19        162     58      34.1    1
3      4         Ayesha    Female  22        170     65      31.7    1
4      5         Bilal     Male    40        168     63      26.0    1
5      6         Hina      Female  20        166     62      17.4    1
6      7         Kamran    Male    23        172     68      18.7    1
7      8         Nata      Female  19        161     57      25.9    1
8      9         Omar      Male    18        159     54      27.2    1
9      10        Sana      Female  22        171     66      30.5    1
Name: count, dtype: int64

In [70]:
OurDf.notnull()

   Index  Roll_no.  FullName  Gender  YearsOld  Height  Weight  BMIs
A   True      True      True    True      True    True    True  True
B   True      True      True    True      True    True    True  True
C   True      True      True    True      True    True    True  True
D   True      True      True    True      True    True    True  True
E   True      True      True    True      True    True    True  True
F   True      True      True    True      True    True    True  True
G   True      True      True    True      True    True    True  True
H   True      True      True    True      True    True    True  True
I   True      True      True    True      True    True    True  True
J   True      True      True    True      True    True    True  True

In [71]:
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Nata  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [72]:
FilteredPeople = OurDf.query("YearsOld > 19 and Weight >= 60 and Height < 170 ")
FilteredPeople

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
B      1         2     Nata  Female        20     165      60  34.4
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4

In [73]:
FilteredGender = OurDf[OurDf['Gender'].isin(['Male'])]
FilteredGender

   Index  Roll_no. FullName Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid   Male        18     160      55  24.5
C      2         3    Ahmed   Male        19     162      58  34.1
E      4         5    Bilal   Male        40     168      63  26.0
G      6         7   Kamran   Male        23     172      68  18.7
I      8         9     Omar   Male        18     159      54  27.2

In [74]:
FilteredHeight = OurDf[OurDf['Height'] > 165]
FilteredHeight

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
J      9        10     Sana  Female        22     171      66  30.5

In [75]:
FilteredData = OurDf[(OurDf['Height'] > 165) & (OurDf['Gender'] == 'Female')]
FilteredData

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
D      3         4   Ayesha  Female        22     170      65  31.7
F      5         6     Hina  Female        20     166      62  17.4
J      9        10     Sana  Female        22     171      66  30.5

In [76]:
Agg_Values = OurDf.groupby('FullName')['Height'].agg(['sum','mean'])
Agg_Values

          sum   mean
FullName
Ahmed     162  162.0
Ayesha    170  170.0
Bilal     168  168.0
Hina      166  166.0
Kamran    172  172.0
Nata      326  163.0
Omar      159  159.0
Sajid     160  160.0
Sana      171  171.0

In [77]:
SortedValues = OurDf.sort_values(by ='Height', ascending = False)
SortedValues

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
G      6         7   Kamran    Male        23     172      68  18.7
J      9        10     Sana  Female        22     171      66  30.5
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
H      7         8     Nata  Female        19     161      57  25.9
A      0         1    Sajid    Male        18     160      55  24.5
I      8         9     Omar    Male        18     159      54  27.2

In [78]:
SortedValues2 = OurDf.sort_values(by ='Height', ascending = True)
SortedValues2

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
I      8         9     Omar    Male        18     159      54  27.2
A      0         1    Sajid    Male        18     160      55  24.5
H      7         8     Nata  Female        19     161      57  25.9
C      2         3    Ahmed    Male        19     162      58  34.1
B      1         2     Nata  Female        20     165      60  34.4
F      5         6     Hina  Female        20     166      62  17.4
E      4         5    Bilal    Male        40     168      63  26.0
D      3         4   Ayesha  Female        22     170      65  31.7
J      9        10     Sana  Female        22     171      66  30.5
G      6         7   Kamran    Male        23     172      68  18.7

In [79]:
OurDf = OurDf.rename(columns = {'YearsOld':'Age'})
OurDf

   Index  Roll_no. FullName  Gender  Age  Height  Weight  BMIs
A      0         1    Sajid    Male   18     160      55  24.5
B      1         2     Nata  Female   20     165      60  34.4
C      2         3    Ahmed    Male   19     162      58  34.1
D      3         4   Ayesha  Female   22     170      65  31.7
E      4         5    Bilal    Male   40     168      63  26.0
F      5         6     Hina  Female   20     166      62  17.4
G      6         7   Kamran    Male   23     172      68  18.7
H      7         8     Nata  Female   19     161      57  25.9
I      8         9     Omar    Male   18     159      54  27.2
J      9        10     Sana  Female   22     171      66  30.5

In [80]:
OurDf['FullName'] = OurDf['FullName'].replace('Omar','Sajid')
OurDf

   Index  Roll_no. FullName  Gender  Age  Height  Weight  BMIs
A      0         1    Sajid    Male   18     160      55  24.5
B      1         2     Nata  Female   20     165      60  34.4
C      2         3    Ahmed    Male   19     162      58  34.1
D      3         4   Ayesha  Female   22     170      65  31.7
E      4         5    Bilal    Male   40     168      63  26.0
F      5         6     Hina  Female   20     166      62  17.4
G      6         7   Kamran    Male   23     172      68  18.7
H      7         8     Nata  Female   19     161      57  25.9
I      8         9    Sajid    Male   18     159      54  27.2
J      9        10     Sana  Female   22     171      66  30.5

In [70]:
Info = {
    'Name' : ['Muskan', 'Karishma', 'Laksh','Kashish','Aadi','Varkha','Ayush','Danish',np.nan, 'Karishma'],
    'Age' : [24, 25, 17, 18, 15, np.nan, 14, 25,np.nan, 25],
    'Salary' : [25000, 30000, 40000, np.nan, 50000, 32000, np.nan, 80000,np.nan, 30000],
    'City' : ['Islamabad', np.nan, 'Karachi', 'Hyderabad', 'Sukkur', 'Lahore', 'Kashmir', 'Kashmoor',np.nan, 'Islamabad'],
    'Age' : [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan,np.nan, np.nan],
}
df = pd.DataFrame(Info)

df

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN      NaN        NaN
9  Karishma  NaN  30000.0  Islamabad

In [71]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [69]:
df.duplicated(subset = ['Name'])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [82]:
df.isnull()

    Name   Age  Salary   City
0  False  True   False  False
1  False  True   False   True
2  False  True   False  False
3  False  True    True  False
4  False  True   False  False
5  False  True   False  False
6  False  True    True  False
7  False  True   False  False
8   True  True    True   True
9  False  True   False  False

In [83]:
df.isnull().sum()

Name       1
Age       10
Salary     3
City       2
dtype: int64

In [84]:
CleanedDf = df.dropna()
CleanedDf

Empty DataFrame
Columns: [Name, Age, Salary, City]
Index: []

In [85]:
CleanedDfByAll = df.dropna(how = 'all')
CleanedDfByAll

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
9  Karishma  NaN  30000.0  Islamabad

In [86]:
CleanedDfByAny = df.dropna(how = 'any')
CleanedDfByAny

Empty DataFrame
Columns: [Name, Age, Salary, City]
Index: []

In [87]:
df

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN      NaN        NaN
9  Karishma  NaN  30000.0  Islamabad

In [88]:
df.fillna(method = 'pad')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6940\2275225546.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'pad')

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0  Islamabad
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN  40000.0  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN  32000.0    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8    Danish  NaN  80000.0   Kashmoor
9  Karishma  NaN  30000.0  Islamabad

In [89]:
df.fillna(method = 'bfill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_6940\3673297803.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0    Karachi
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN  50000.0  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN  80000.0    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8  Karishma  NaN  30000.0  Islamabad
9  Karishma  NaN  30000.0  Islamabad

In [90]:
df.fillna(method = 'pad', axis = 0)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6940\3706391347.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'pad', axis = 0)

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0  Islamabad
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN  40000.0  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN  32000.0    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8    Danish  NaN  80000.0   Kashmoor
9  Karishma  NaN  30000.0  Islamabad

In [91]:
df.fillna(method = 'ffill', axis = 1)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6940\3272608729.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 1)
C:\Users\DELL\AppData\Local\Temp\ipykernel_6940\3272608729.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method = 'ffill', axis = 1)

       Name       Age   Salary       City
0    Muskan    Muskan  25000.0  Islamabad
1  Karishma  Karishma  30000.0    30000.0
2     Laksh     Laksh  40000.0    Karachi
3   Kashish   Kashish  Kashish  Hyderabad
4      Aadi      Aadi  50000.0     Sukkur
5    Varkha    Varkha  32000.0     Lahore
6     Ayush     Ayush    Ayush    Kashmir
7    Danish    Danish  80000.0   Kashmoor
8       NaN       NaN      NaN        NaN
9  Karishma  Karishma  30000.0  Islamabad

In [92]:
df.drop_duplicates()

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN      NaN        NaN
9  Karishma  NaN  30000.0  Islamabad

In [93]:
df_unique = df.drop_duplicates(subset=['City'], keep = 'first')
df_unique

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor

In [94]:
df_unique2 = df.drop_duplicates(subset=['City'], keep = 'last')
df_unique2

       Name  Age   Salary       City
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN      NaN        NaN
9  Karishma  NaN  30000.0  Islamabad

In [95]:
df_unique3 = df.drop_duplicates(subset=['City'], keep = False)
df_unique3

      Name  Age   Salary       City
2    Laksh  NaN  40000.0    Karachi
3  Kashish  NaN      NaN  Hyderabad
4     Aadi  NaN  50000.0     Sukkur
5   Varkha  NaN  32000.0     Lahore
6    Ayush  NaN      NaN    Kashmir
7   Danish  NaN  80000.0   Kashmoor

In [96]:
df['City'].unique()

array(['Islamabad', nan, 'Karachi', 'Hyderabad', 'Sukkur', 'Lahore',
       'Kashmir', 'Kashmoor'], dtype=object)

In [97]:
df['Name'].unique()

array(['Muskan', 'Karishma', 'Laksh', 'Kashish', 'Aadi', 'Varkha',
       'Ayush', 'Danish', nan], dtype=object)

In [98]:
df['City'].value_counts()

City
Islamabad    2
Karachi      1
Hyderabad    1
Sukkur       1
Lahore       1
Kashmir      1
Kashmoor     1
Name: count, dtype: int64

In [99]:
df4=df.fillna({'City':'Rawalpindi','Salary': 80000})
df4

       Name  Age   Salary        City
0    Muskan  NaN  25000.0   Islamabad
1  Karishma  NaN  30000.0  Rawalpindi
2     Laksh  NaN  40000.0     Karachi
3   Kashish  NaN  80000.0   Hyderabad
4      Aadi  NaN  50000.0      Sukkur
5    Varkha  NaN  32000.0      Lahore
6     Ayush  NaN  80000.0     Kashmir
7    Danish  NaN  80000.0    Kashmoor
8       NaN  NaN  80000.0  Rawalpindi
9  Karishma  NaN  30000.0   Islamabad

In [100]:
df5=df.fillna({'Salary':df['Salary'].mean()})
df5

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN  41000.0  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN  41000.0    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN  41000.0        NaN
9  Karishma  NaN  30000.0  Islamabad

In [101]:
df6=df.fillna({'Salary':df['Salary'].sum()})
df6

       Name  Age    Salary       City
0    Muskan  NaN   25000.0  Islamabad
1  Karishma  NaN   30000.0        NaN
2     Laksh  NaN   40000.0    Karachi
3   Kashish  NaN  287000.0  Hyderabad
4      Aadi  NaN   50000.0     Sukkur
5    Varkha  NaN   32000.0     Lahore
6     Ayush  NaN  287000.0    Kashmir
7    Danish  NaN   80000.0   Kashmoor
8       NaN  NaN  287000.0        NaN
9  Karishma  NaN   30000.0  Islamabad

In [102]:
import numpy as np
df7=df.replace(to_replace='Sukkur',value="Kotri")
df7

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0      Kotri
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN      NaN        NaN
9  Karishma  NaN  30000.0  Islamabad

In [103]:
df8=df.replace(to_replace='Islamabad',value="Queeta")
df8

       Name  Age   Salary       City
0    Muskan  NaN  25000.0     Queeta
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor
8       NaN  NaN      NaN        NaN
9  Karishma  NaN  30000.0     Queeta

In [104]:
df9=df.replace(to_replace= np.nan,value="Queeta")
df9

       Name     Age   Salary       City
0    Muskan  Queeta  25000.0  Islamabad
1  Karishma  Queeta  30000.0     Queeta
2     Laksh  Queeta  40000.0    Karachi
3   Kashish  Queeta   Queeta  Hyderabad
4      Aadi  Queeta  50000.0     Sukkur
5    Varkha  Queeta  32000.0     Lahore
6     Ayush  Queeta   Queeta    Kashmir
7    Danish  Queeta  80000.0   Kashmoor
8    Queeta  Queeta   Queeta     Queeta
9  Karishma  Queeta  30000.0  Islamabad

In [105]:
df['City'].replace(to_replace= np.nan,value="Queeta")
# df['City'] = df['City'].replace(to_replace= np.nan,value="Queeta")

0    Islamabad
1       Queeta
2      Karachi
3    Hyderabad
4       Sukkur
5       Lahore
6      Kashmir
7     Kashmoor
8       Queeta
9    Islamabad
Name: City, dtype: object

In [106]:
df.drop_duplicates(subset = ['City'], keep='first', inplace=True)
df

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor

In [107]:
df.drop_duplicates(subset = ['City'], keep='first', inplace=False)

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor

In [108]:
df

       Name  Age   Salary       City
0    Muskan  NaN  25000.0  Islamabad
1  Karishma  NaN  30000.0        NaN
2     Laksh  NaN  40000.0    Karachi
3   Kashish  NaN      NaN  Hyderabad
4      Aadi  NaN  50000.0     Sukkur
5    Varkha  NaN  32000.0     Lahore
6     Ayush  NaN      NaN    Kashmir
7    Danish  NaN  80000.0   Kashmoor

In [109]:
x='1200-2000'
tokens = x.split('-')
tokens

['1200', '2000']

In [110]:
x='1200_2000'
tokens = x.split('_')
tokens

['1200', '2000']

In [111]:
A='1200_2000'
slices = A.split('_')
slices

['1200', '2000']

Outliers

In [74]:
Score = {
    'Marks' : [20,30,45,47,49,50,60,53,56,64,66,67,69,70,72,71,75,78,80,92,99]
}
Score_df = pd.DataFrame(Score)
Score_df

    Marks
0      20
1      30
2      45
3      47
4      49
5      50
6      60
7      53
8      56
9      64
10     66
11     67
12     69
13     70
14     72
15     71
16     75
17     78
18     80
19     92
20     99

In [75]:
lower = 40
upper = 80
outliers = Score_df[(Score_df['Marks'] > lower) | (Score_df['Marks'] < upper)]
print(outliers)

    Marks
0      20
1      30
2      45
3      47
4      49
5      50
6      60
7      53
8      56
9      64
10     66
11     67
12     69
13     70
14     72
15     71
16     75
17     78
18     80
19     92
20     99

In [77]:
Score_df['Marks'].unique()

array([20, 30, 45, 47, 49, 50, 60, 53, 56, 64, 66, 67, 69, 70, 72, 71, 75,
       78, 80, 92, 99])

In [83]:
Employees = {
 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace','Cavendish'],
 'Age': [25, 30, np.nan, 22, 28, 35, 29, 31],
 'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles','Chicago','Los Angeles','Chicago'],
 'Salary': [50000, 60000, 75000, 45000, 55000, 80000, 38000, 70000],
 'Department': ['Sales', 'IT', 'Sales', 'IT', 'Sales', 'IT', 'Sales','IT']
}
Employeesdf = pd.DataFrame(Employees)
Employeesdf

        Name   Age         City  Salary Department
0      Alice  25.0     New York   50000      Sales
1        Bob  30.0  Los Angeles   60000         IT
2    Charlie   NaN     New York   75000      Sales
3      David  22.0      Chicago   45000         IT
4        Eve  28.0  Los Angeles   55000      Sales
5      Frank  35.0      Chicago   80000         IT
6      Grace  29.0  Los Angeles   38000      Sales
7  Cavendish  31.0      Chicago   70000         IT

In [93]:
pd.cut(df['Salary'], bins=[60000,70000,80000], labels=['Medium','High'])  
#, bins=[60000,80000], labels=['Hig
# df

0       NaN
1       NaN
2      High
3       NaN
4       NaN
5      High
6       NaN
7    Medium
Name: Salary, dtype: category
Categories (2, object): ['Medium' < 'High']

In [95]:
Employeesdf['Salary_Band']= pd.cut(df['Salary'], bins=[60000,70000,80000], labels=['Medium','High'])
Employeesdf

        Name   Age         City  Salary Department Salary_Band
0      Alice  25.0     New York   50000      Sales         NaN
1        Bob  30.0  Los Angeles   60000         IT         NaN
2    Charlie   NaN     New York   75000      Sales        High
3      David  22.0      Chicago   45000         IT         NaN
4        Eve  28.0  Los Angeles   55000      Sales         NaN
5      Frank  35.0      Chicago   80000         IT        High
6      Grace  29.0  Los Angeles   38000      Sales         NaN
7  Cavendish  31.0      Chicago   70000         IT      Medium

In [97]:
new_row = {'Name': ['Kelly'], 'Age': [27], 'City' : ['New York'], 'Salary' : [90000], 'Department' : ['DS']}
new_row_df = pd.DataFrame(new_row)
new_row_df

    Name  Age      City  Salary Department
0  Kelly   27  New York   90000         DS

In [98]:
df_combined = pd.concat([Employeesdf, new_row_df], ignore_index=True)
df_combined

        Name   Age         City  Salary Department Salary_Band
0      Alice  25.0     New York   50000      Sales         NaN
1        Bob  30.0  Los Angeles   60000         IT         NaN
2    Charlie   NaN     New York   75000      Sales        High
3      David  22.0      Chicago   45000         IT         NaN
4        Eve  28.0  Los Angeles   55000      Sales         NaN
5      Frank  35.0      Chicago   80000         IT        High
6      Grace  29.0  Los Angeles   38000      Sales         NaN
7  Cavendish  31.0      Chicago   70000         IT      Medium
8      Kelly  27.0     New York   90000         DS         NaN

In [101]:
df_combined.iloc[2,1]=30
df_combined

        Name   Age         City  Salary Department Salary_Band
0      Alice  25.0     New York   50000      Sales         NaN
1        Bob  30.0  Los Angeles   60000         IT         NaN
2    Charlie  30.0     New York   75000      Sales        High
3      David  22.0      Chicago   45000         IT         NaN
4        Eve  28.0  Los Angeles   55000      Sales         NaN
5      Frank  35.0      Chicago   80000         IT        High
6      Grace  29.0  Los Angeles   38000      Sales         NaN
7  Cavendish  31.0      Chicago   70000         IT      Medium
8      Kelly  27.0     New York   90000         DS         NaN

In [103]:
df_combined['Age'] = df_combined['Age'].astype(int)
df_combined

        Name  Age         City  Salary Department Salary_Band
0      Alice   25     New York   50000      Sales         NaN
1        Bob   30  Los Angeles   60000         IT         NaN
2    Charlie   30     New York   75000      Sales        High
3      David   22      Chicago   45000         IT         NaN
4        Eve   28  Los Angeles   55000      Sales         NaN
5      Frank   35      Chicago   80000         IT        High
6      Grace   29  Los Angeles   38000      Sales         NaN
7  Cavendish   31      Chicago   70000         IT      Medium
8      Kelly   27     New York   90000         DS         NaN

In [105]:
agg_salaries = df.groupby('City')['Salary'].agg(['sum','mean', 'median','min','max'])
agg_salaries

                sum     mean   median    min    max
City
Chicago      195000  65000.0  70000.0  45000  80000
Los Angeles  153000  51000.0  55000.0  38000  60000
New York     125000  62500.0  62500.0  50000  75000